app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", nil], ["updated_at", "2021-03-11 07:18:59.888937"], ["id", 1]]
---
  def update
   @article = Article.find(params[:id])
   @article.update(title: params[:article][:title], description: params[:article][:descriptiom])